ChiaYuan93/PIC18-Simulator/src/RegisterAddress.h
#ifndef RegisterAddress_H
#define RegisterAddress_H

int fileMemory[0xFF];
int memory[0xFFF]; 
#define TOSU memory[0xFFF]
#define TOSh memory[0xFFE]
#define TOSL memory[0xFFD]
#define STKPTR memory[0xFFC]
#define PCLATU  memory[0xFFB]
#define PCLATH  memory[0xFFA]
#define PCL memory[0xFF9]
#define TBLPTRU memory[0xFF8]
#define TBLPTRH memory[0xFF7]
#define TBLPTRL memory[0xFF6]
#define TABLAT memory[0xFF5]
#define PRODH memory[0xFF4]
#define PRODL memory[0xFF3]
#define INTCON memory[0xFF2]
#define INTCON2 memory[0xFF1]
#define INTCON3 memory[0xFF0]
#define INDF0 memory[0xFEF]
#define POSTINC0 memory[0xFEE]
#define POSTDEC0 memory[0xFED]
#define PREINC0 memory[0xFEC]
#define PLUSW0 memory[0xFEB]
#define FSR0H memory[0xFEA]
#define FSR0L memory[0xFE9]
#define WREG  memory[0xFE8]
#define INDF1 memory[0xFE7]
#define POSTINC1 memory[0xFE6]
#define POSTDEC1 memory[0xFE5]
#define PREINC1 memory[0xFE4]
#define PLUSW1 memory[0xFE3]
#define FSR1H memory[0xFE2]
#define FSR1L memory[0xFE1]
#define	BSR memory[0xFE0]

#define INDF2  memory[0xFDF]
#define POSTINC2  memory[0xFDE]
#define POSTDEC2  memory[0xFDD]
#define PREINC2  memory[0xFDC]
#define PLUSW2  memory[0xFDB]
#define FSR2H  memory[0xFDA]
#define FSR2L memory[0xFD9]
#define STATUS  memory[0xFD8]
#define TMR0H  memory[0xFD7]
#define TMR0L  memory[0xFD6]
#define T0CON  memory[0xFD5]
#define OSCCON  memory[0xFD3]
#define HLVDCON  memory[0xFD2]
#define WDTCON  memory[0xFD1]
#define RCON  memory[0xFD0]
#define TMR1H  memory[0xFCF]
#define TMR1L  memory[0xFCE]
#define T1CON  memory[0xFCD]
#define TMR2  memory[0xFCC]
#define PR2  memory[0xFCB]
#define T2CON  memory[0xFCA]
#define SSPBUF  memory[0xFC9]
#define SSPADD  memory[0xFC8]
#define SSPSTAT  memory[0xFC7]
#define SSPCON1  memory[0xFC6]
#define SSPCON2  memory[0xFC5]
#define ADRESH  memory[0xFC4]
#define ADRESL  memory[0xFC3]
#define ADCON0  memory[0xFC2]
#define ADCON1  memory[0xFC1]
#define ADCON2  memory[0xFC0]

#define CCPR1H  memory[0xFBF]
#define CCPR1L  memory[0xFBE]
#define CCP1CON  memory[0xFBD]
#define CCPR2H  memory[0xFBC]
#define CCPR2L  memory[0xFBB]
#define CCP2CON  memory[0xFBA]
#define BAUDCON  memory[0xFB8]
#define PWM1CON  memory[0xFB7]
#define ECCP1AS  memory[0xFB6]
#define CVRCON  memory[0xFB5]
#define CMCON  memory[0xFB4]
#define TMR3H  memory[0xFB3]
#define TMR3L  memory[0xFB2]
#define T3CON  memory[0xFB1]
#define SPBRGH  memory[0xFB0]
#define SPBRG  memory[0xFAF]
#define RCREG  memory[0xFAE]
#define TXREG  memory[0xFAD]
#define TXSTA  memory[0xFAC]
#define RCSTA  memory[0xFAb]
#define EEADR  memory[0xFA9]
#define EEDATA  memory[0xFA8]
#define EECON2  memory[0xFA7]
#define EECON1  memory[0xFA6]
#define IPR2  memory[0xFA2]
#define PIR2  memory[0xFA1]
#define PIE2  memory[0xFA0]

#define IPR1  memory[0xF9F]
#define PIR1  memory[0xF9E]
#define PIE1  memory[0xF9D]
#define OSCTUNE  memory[0xF9B]
#define TRISE  memory[0xF96]
#define TRISD  memory[0xF95]
#define TRISC  memory[0xF94]
#define TRISB  memory[0xF93]
#define TRISA  memory[0xF92]
#define LATE  memory[0xF8D]
#define LATD  memory[0xF8C]
#define LATC  memory[0xF8B]
#define LATB  memory[0xF8A]
#define LATA  memory[0xF89]
#define PORTE  memory[0xF84]
#define PORTD  memory[0xF83]
#define PORTC  memory[0xF82]
#define PORTB  memory[0xF81]
#define PORTA  memory[0xF80]

#endif // RegisterAddress_H
